yingyuezhiyun/W003_002/cfg.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F2837xD" --part "F2837xD_176PTP" --package "F2837xD_176PTP" --context "CPU1" --product "C2000WARE@6.00.01.00"
 * @v2CliArgs --device "TMS320F28377D" --package "176PTP" --context "CPU1" --product "C2000WARE@6.00.01.00"
 * @versions {"tool":"1.26.2+4477"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc              = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1             = adc.addInstance();
const adc2             = adc.addInstance();
const adc3             = adc.addInstance();
const can              = scripting.addModule("/driverlib/can.js", {}, false);
const can1             = can.addInstance();
const cputimer         = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1        = cputimer.addInstance();
const cputimer2        = cputimer.addInstance();
const dma              = scripting.addModule("/driverlib/dma.js", {}, false);
const dma1             = dma.addInstance();
const dma2             = dma.addInstance();
const epwm             = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1            = epwm.addInstance();
const epwm2            = epwm.addInstance();
const gpio             = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1            = gpio.addInstance();
const gpio2            = gpio.addInstance();
const gpio3            = gpio.addInstance();
const gpio4            = gpio.addInstance();
const gpio5            = gpio.addInstance();
const gpio6            = gpio.addInstance();
const gpio7            = gpio.addInstance();
const gpio8            = gpio.addInstance();
const gpio9            = gpio.addInstance();
const gpio10           = gpio.addInstance();
const gpio11           = gpio.addInstance();
const gpio12           = gpio.addInstance();
const gpio13           = gpio.addInstance();
const gpio14           = gpio.addInstance();
const gpio15           = gpio.addInstance();
const gpio16           = gpio.addInstance();
const gpio17           = gpio.addInstance();
const gpio18           = gpio.addInstance();
const gpio19           = gpio.addInstance();
const gpio20           = gpio.addInstance();
const gpio21           = gpio.addInstance();
const i2c              = scripting.addModule("/driverlib/i2c.js", {}, false);
const i2c1             = i2c.addInstance();
const i2c2             = i2c.addInstance();
const inputxbar        = scripting.addModule("/driverlib/inputxbar.js", {}, false);
const inputxbar1       = inputxbar.addInstance();
const inputxbar_input  = scripting.addModule("/driverlib/inputxbar_input.js", {}, false);
const inputxbar_input1 = inputxbar_input.addInstance();
const inputxbar_input2 = inputxbar_input.addInstance();
const inputxbar_input3 = inputxbar_input.addInstance();
const sci              = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1             = sci.addInstance();
const sci2             = sci.addInstance();
const sci3             = sci.addInstance();
const spi              = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1             = spi.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.adcResolutionMode              = "ADC_RESOLUTION_16BIT";
adc1.adcSignalMode                  = "ADC_MODE_DIFFERENTIAL";
adc1.enabledSOCs                    = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc1.soc1SampleWindow               = 64;
adc1.$name                          = "ADC_A";
adc1.soc0Name                       = "CDG2";
adc1.soc0Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc0Channel                    = "ADC_CH_ADCIN4_ADCIN5";
adc1.soc1Channel                    = "ADC_CH_ADCIN2_ADCIN3";
adc1.soc1Trigger                    = "ADC_TRIGGER_EPWM2_SOCA";
adc1.interruptPulseMode             = "ADC_PULSE_END_OF_CONV";
adc1.registerInterrupts             = ["1"];
adc1.useInterrupts                  = false;
adc1.soc1Name                       = "PWR";
adc1.soc0InputCapacitance           = 100000;
adc1.soc0SampleWindow               = 256;
adc1.adcClockPrescaler              = "ADC_CLK_DIV_4_0";
adc1.soc0UseSampleTimeCalculator    = true;
adc1.soc0InputResistance            = 150;
adc1.socHighPriorityMode            = "ADC_PRI_SOC0_HIPRI";
adc1.enabledInts                    = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1ContinuousMode = true;
adc1.enableInterrupt1               = true;

adc2.adcClockPrescaler              = "ADC_CLK_DIV_4_0";
adc2.adcResolutionMode              = "ADC_RESOLUTION_16BIT";
adc2.adcSignalMode                  = "ADC_MODE_DIFFERENTIAL";
adc2.$name                          = "ADC_C";
adc2.adcBase                        = "ADCC_BASE";
adc2.enabledSOCs                    = ["ADC_SOC_NUMBER0"];
adc2.soc0Name                       = "CDG1";
adc2.soc0Channel                    = "ADC_CH_ADCIN2_ADCIN3";
adc2.soc0Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc2.useInterrupts                  = false;
adc2.soc0SampleWindow               = 256;
adc2.interruptPulseMode             = "ADC_PULSE_END_OF_CONV";
adc2.enabledInts                    = ["ADC_INT_NUMBER1"];
adc2.enableInterrupt1ContinuousMode = true;
adc2.enableInterrupt1               = true;

adc3.adcBase            = "ADCD_BASE";
adc3.$name              = "ADC_D";
adc3.adcClockPrescaler  = "ADC_CLK_DIV_4_0";
adc3.adcResolutionMode  = "ADC_RESOLUTION_16BIT";
adc3.adcSignalMode      = "ADC_MODE_DIFFERENTIAL";
adc3.soc15Channel       = "ADC_CH_ADCIN14_ADCIN15";
adc3.soc14Channel       = "ADC_CH_ADCIN14_ADCIN15";
adc3.soc0Channel        = "ADC_CH_ADCIN0_ADCIN1";
adc3.soc0Trigger        = "ADC_TRIGGER_EPWM2_SOCA";
adc3.soc0SampleWindow   = 64;
adc3.soc1Channel        = "ADC_CH_ADCIN2_ADCIN3";
adc3.soc1Name           = "Temp";
adc3.soc1Trigger        = "ADC_TRIGGER_EPWM2_SOCA";
adc3.soc1SampleWindow   = 64;
adc3.soc2Channel        = "ADC_CH_ADCIN14_ADCIN15";
adc3.soc2SampleWindow   = 64;
adc3.soc2Trigger        = "ADC_TRIGGER_EPWM2_SOCA";
adc3.enabledSOCs        = ["ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc3.registerInterrupts = ["1"];
adc3.useInterrupts      = false;
adc3.soc2Name           = "BATT";

can1.$name                   = "Elmo_CAN";
can1.enableInterrupt         = true;
can1.interruptFlags          = ["CAN_INT_IE0"];
can1.interruptLine           = ["CAN_GLOBAL_INT_CANINT0"];
can1.registerInterrupts      = true;
can1.msgObjsUsed             = [1,2,3,4,5];
can1.can.canrxPin.$assign    = "GPIO36";
can1.can.cantxPin.$assign    = "GPIO37";
can1.can0Int.enableInterrupt = true;
can1.msgObj1.$name           = "msgObj0";
can1.msgObj1.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj1.msgID           = 1663;
can1.msgObj1.msgLen          = 8;
can1.msgObj2.$name           = "msgObj1";
can1.msgObj2.msgLen          = 8;
can1.msgObj2.msgID           = 1663;
can1.msgObj2.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj3.$name           = "msgObj2";
can1.msgObj3.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj3.msgLen          = 8;
can1.msgObj3.msgID           = 1663;
can1.msgObj4.$name           = "msgObj3";
can1.msgObj4.msgType         = "CAN_MSG_OBJ_TYPE_TX";
can1.msgObj4.msgLen          = 8;
can1.msgObj4.msgID           = 1663;
can1.msgObj5.$name           = "msgObj4";
can1.msgObj5.msgID           = 1535;
can1.msgObj5.msgIDMask       = 2047;
can1.msgObj5.flags           = ["CAN_MSG_OBJ_RX_INT_ENABLE","CAN_MSG_OBJ_USE_ID_FILTER"];

const divider3 = system.clockTree["EPWMCLKDIV"];
scripting.suppress("ePWM TZFRC and TZCLR events will sometimes be missed when EPWMCLKDIV is divide by 2\\. Always program EPWMCLKDIV to divide by 1 if using TZFRC or TZCLR register\\. Please refer to the F2837xD Silicon Errata for more details\\.", divider3, "EPWMCLK");

