yingyuezhiyun/W003_002/cfg.syscfg
const multiplier4         = system.clockTree["PLL_IMULT"];
multiplier4.multiplyValue = 20;

const mux8       = system.clockTree["XTAL_OR_X1"];
mux8.inputSelect = "X1";

cputimer1.enableInterrupt          = true;
cputimer1.emulationMode            = "CPUTIMER_EMULATIONMODE_RUNFREE";
cputimer1.registerInterrupts       = true;
cputimer1.cputimerBase             = "CPUTIMER2_BASE";
cputimer1.timerPrescaler           = 199;
cputimer1.$name                    = "CPU_TIMER2";
cputimer1.timerPeriod              = 1000;
cputimer1.timerInt.enableInterrupt = true;

cputimer2.enableInterrupt          = true;
cputimer2.registerInterrupts       = true;
cputimer2.emulationMode            = "CPUTIMER_EMULATIONMODE_RUNFREE";
cputimer2.timerPrescaler           = 19;
cputimer2.$name                    = "CPU_TIMER0";
cputimer2.timerPeriod              = 1000;
cputimer2.timerInt.enableInterrupt = true;

dma1.$name                   = "myDMA0";
dma1.enableTriggers          = true;
dma1.useInterrupts           = true;
dma1.registerInterrupts      = true;
dma1.enableInterrupts        = true;
dma1.enableOverrunInterrupt  = true;
dma1.interruptMode           = "DMA_INT_AT_END";
dma1.continuousModeConfig    = "DMA_CFG_CONTINUOUS_ENABLE";
dma1.transferSize            = 8;
dma1.destTransferStep        = 1;
dma1.triggerSource           = "DMA_TRIGGER_ADCC1";
dma1.dmaInt.enableInterrupt  = true;
dma1.dmaInt.interruptHandler = "INT_DMA0_ISR";

dma2.$name                   = "myDMA1";
dma2.dmaBase                 = "DMA_CH2_BASE";
dma2.enableTriggers          = true;
dma2.useInterrupts           = true;
dma2.registerInterrupts      = true;
dma2.enableInterrupts        = true;
dma2.enableOverrunInterrupt  = true;
dma2.transferSize            = 8;
dma2.destTransferStep        = 1;
dma2.triggerSource           = "DMA_TRIGGER_ADCA1";
dma2.continuousModeConfig    = "DMA_CFG_CONTINUOUS_ENABLE";
dma2.interruptMode           = "DMA_INT_AT_END";
dma2.dmaInt.enableInterrupt  = true;
dma2.dmaInt.interruptHandler = "INT_DMA1_ISR";

epwm1.$name                                             = "myEPWM0";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable         = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar = "1";
epwm1.epwmTimebase_period                               = 2500;
epwm1.epwmTimebase_counterMode                          = "EPWM_COUNTER_MODE_UP";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerSource         = "EPWM_SOC_TBCTR_ZERO";
epwm1.useCase                                           = "CUSTOM";
epwm1.epwmCounterCompare_enableShadowLoadModeCMPA       = false;
epwm1.epwmCounterCompare_enableShadowLoadModeCMPB       = false;
epwm1.epwmCounterCompare_enableShadowLoadModeCMPC       = false;
epwm1.epwmCounterCompare_enableShadowLoadModeCMPD       = false;
epwm1.epwmTimebase_syncOutPulseMode                     = "EPWM_SYNC_OUT_PULSE_DISABLED";
epwm1.epwm.$assign                                      = "EPWM1";

epwm2.$name                                             = "myEPWM1";
epwm2.epwmTimebase_hsClockDiv                           = "EPWM_HSCLOCK_DIVIDER_10";
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEnable         = true;
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar = "1";
epwm2.epwmTimebase_counterMode                          = "EPWM_COUNTER_MODE_UP";
epwm2.epwmTimebase_clockDiv                             = "EPWM_CLOCK_DIVIDER_4";
epwm2.epwmTimebase_period                               = 25000;
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerSource         = "EPWM_SOC_TBCTR_ZERO";
epwm2.useCase                                           = "CUSTOM";
epwm2.epwmCounterCompare_enableShadowLoadModeCMPA       = false;
epwm2.epwmCounterCompare_enableShadowLoadModeCMPB       = false;
epwm2.epwmCounterCompare_enableShadowLoadModeCMPC       = false;
epwm2.epwmCounterCompare_enableShadowLoadModeCMPD       = false;
epwm2.epwmTimebase_syncOutPulseMode                     = "EPWM_SYNC_OUT_PULSE_DISABLED";
epwm2.epwm.$assign                                      = "EPWM2";

gpio1.$name             = "ECAT_SPI_CS";
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.writeInitialValue = true;
gpio1.initialValue      = 1;
gpio1.gpioPin.$assign   = "GPIO61";

gpio2.useInterrupt               = true;
gpio2.$name                      = "ECAT_ISR";
gpio2.qualMode                   = "GPIO_QUAL_ASYNC";
gpio2.gpioPin.$assign            = "GPIO67";
gpio2.xint.enableInt             = true;
gpio2.xint.registerInterrupts    = true;
gpio2.xint.xInt.enableInterrupt  = true;
gpio2.xint.xInt.interruptHandler = "ECAT_Lan9252IrqIsr";

gpio3.$name                      = "ECAT_SYNC0_ISR";
gpio3.useInterrupt               = true;
gpio3.qualMode                   = "GPIO_QUAL_ASYNC";
gpio3.gpioPin.$assign            = "GPIO68";
gpio3.xint.xintNum               = "GPIO_INT_XINT2";
gpio3.xint.enableInt             = true;
gpio3.xint.registerInterrupts    = true;
gpio3.xint.xInt.interruptHandler = "ECAT_Sync0Isr";
gpio3.xint.xInt.enableInterrupt  = true;

gpio4.$name                      = "ECAT_SYNC1_ISR";
gpio4.useInterrupt               = true;
gpio4.qualMode                   = "GPIO_QUAL_ASYNC";
gpio4.gpioPin.$assign            = "GPIO69";
gpio4.xint.xintNum               = "GPIO_INT_XINT3";
gpio4.xint.enableInt             = true;
gpio4.xint.registerInterrupts    = true;
gpio4.xint.xInt.interruptHandler = "ECAT_Sync1Isr";
gpio4.xint.xInt.enableInterrupt  = true;

gpio5.$name           = "ECAT_EN";
gpio5.direction       = "GPIO_DIR_MODE_OUT";
gpio5.gpioPin.$assign = "GPIO70";

gpio6.$name             = "LED1";
gpio6.direction         = "GPIO_DIR_MODE_OUT";
gpio6.writeInitialValue = true;
gpio6.initialValue      = 1;
gpio6.gpioPin.$assign   = "GPIO63";

gpio7.$name             = "LED2";
gpio7.writeInitialValue = true;
gpio7.direction         = "GPIO_DIR_MODE_OUT";
gpio7.initialValue      = 1;
gpio7.gpioPin.$assign   = "GPIO64";

gpio8.$name             = "POS_CLOSE_LED";
gpio8.direction         = "GPIO_DIR_MODE_OUT";
gpio8.writeInitialValue = true;
gpio8.gpioPin.$assign   = "GPIO73";

gpio9.$name             = "POS_OPEN_LED";
gpio9.writeInitialValue = true;
gpio9.direction         = "GPIO_DIR_MODE_OUT";
gpio9.gpioPin.$assign   = "GPIO74";

gpio10.$name             = "POS_LED";
gpio10.direction         = "GPIO_DIR_MODE_OUT";
gpio10.writeInitialValue = true;
gpio10.gpioPin.$assign   = "GPIO75";

gpio11.$name             = "PRE_LED";
gpio11.direction         = "GPIO_DIR_MODE_OUT";
gpio11.writeInitialValue = true;
gpio11.gpioPin.$assign   = "GPIO76";

gpio12.$name             = "RS232_LED";
gpio12.direction         = "GPIO_DIR_MODE_OUT";
gpio12.writeInitialValue = true;
gpio12.gpioPin.$assign   = "GPIO77";

gpio13.$name             = "BATT_LED";
gpio13.direction         = "GPIO_DIR_MODE_OUT";
gpio13.writeInitialValue = true;
gpio13.gpioPin.$assign   = "GPIO78";

gpio14.$name             = "RUN_LED";
gpio14.direction         = "GPIO_DIR_MODE_OUT";
gpio14.writeInitialValue = true;
gpio14.gpioPin.$assign   = "GPIO79";

gpio15.$name             = "FAULT_LED";
gpio15.writeInitialValue = true;
gpio15.direction         = "GPIO_DIR_MODE_OUT";
gpio15.gpioPin.$assign   = "GPIO80";

