yingyuezhiyun/W003_002/cfg.syscfg
gpio16.$name           = "POS_OPEN_KEY";
gpio16.padConfig       = "PULLUP";
gpio16.gpioPin.$assign = "GPIO81";

gpio17.padConfig       = "PULLUP";
gpio17.$name           = "POS_CLOSE_KEY";
gpio17.gpioPin.$assign = "GPIO82";

gpio18.$name             = "POS_OPEN_TTL_OUT";
gpio18.direction         = "GPIO_DIR_MODE_OUT";
gpio18.writeInitialValue = true;
gpio18.initialValue      = 1;
gpio18.gpioPin.$assign   = "GPIO87";

gpio19.$name             = "POS_CLOSE_TTL_OUT";
gpio19.direction         = "GPIO_DIR_MODE_OUT";
gpio19.writeInitialValue = true;
gpio19.initialValue      = 1;
gpio19.gpioPin.$assign   = "GPIO86";

gpio20.$name           = "POS_OPEN_TTL_IN";
gpio20.padConfig       = "PULLUP";
gpio20.gpioPin.$assign = "GPIO88";

gpio21.$name           = "POS_CLOSE_TTL_IN";
gpio21.padConfig       = "PULLUP";
gpio21.gpioPin.$assign = "GPIO89";

i2c1.useInterrupts      = false;
i2c1.bitCount           = "I2C_BITCOUNT_8";
i2c1.$name              = "e2_i2c";
i2c1.bitRate            = 50000;
i2c1.i2c.sdaPin.$assign = "GPIO42";
i2c1.i2c.sclPin.$assign = "GPIO43";

i2c2.$name              = "a2_i2c";
i2c2.bitRate            = 50000;
i2c2.useInterrupts      = false;
i2c2.bitCount           = "I2C_BITCOUNT_8";
i2c2.i2c.sdaPin.$assign = "GPIO40";
i2c2.i2c.sclPin.$assign = "GPIO41";

inputxbar1.$name = "myINPUTXBAR";

inputxbar_input1.$name         = "myINPUTXBARINPUT0";
gpio2.xint.inputxbar           = inputxbar_input1;
inputxbar_input1.inputxbarGpio = "GPIO67";

inputxbar_input2.$name         = "myINPUTXBARINPUT1";
gpio3.xint.inputxbar           = inputxbar_input2;
inputxbar_input2.inputxbarGpio = "GPIO68";

inputxbar_input3.$name         = "myINPUTXBARINPUT2";
gpio4.xint.inputxbar           = inputxbar_input3;
inputxbar_input3.inputxbarGpio = "GPIO69";

sci1.baudRates             = 9600;
sci1.$name                 = "RS232_SCI";
sci1.useInterrupts         = false;
sci1.sci.scirxdPin.$assign = "GPIO55";
sci1.sci.scitxdPin.$assign = "GPIO54";
sci1.rxQual.$name          = "myGPIOQUAL3";
sci1.txQual.$name          = "myGPIOQUAL4";

sci2.$name                 = "Elmo_SCI";
sci2.useInterrupts         = false;
sci2.sci.scirxdPin.$assign = "GPIO46";
sci2.sci.scitxdPin.$assign = "GPIO47";
sci2.rxQual.$name          = "myGPIOQUAL5";
sci2.txQual.$name          = "myGPIOQUAL6";

sci3.$name                 = "ServicePort_SCI";
sci3.useInterrupts         = false;
sci3.sci.scirxdPin.$assign = "GPIO57";
sci3.sci.scitxdPin.$assign = "GPIO56";
sci3.rxQual.$name          = "myGPIOQUAL7";
sci3.txQual.$name          = "myGPIOQUAL8";

spi1.$name                   = "mySPI0";
spi1.transferProtocol        = "SPI_PROT_POL1PHA0";
spi1.dataWidth               = "8";
spi1.useCase                 = "CUSTOM";
spi1.useInterfacePins        = ["SPICLK@","SPISIMO@","SPISOMI@"];
spi1.mode                    = "SPI_MODE_CONTROLLER";
spi1.useInterrupts           = false;
spi1.bitRate                 = 12000000;
spi1.spi.$assign             = "SPIA";
spi1.spi.spi_picoPin.$assign = "GPIO58";
spi1.spi.spi_pociPin.$assign = "GPIO59";
spi1.spi.spi_clkPin.$assign  = "GPIO60";
spi1.clkQual.$name           = "myGPIOQUAL2";
spi1.picoQual.$name          = "myGPIOQUAL0";
spi1.pociQual.$name          = "myGPIOQUAL1";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
can1.can.$suggestSolution = "CANA";
i2c1.i2c.$suggestSolution = "I2CA";
i2c2.i2c.$suggestSolution = "I2CB";
sci1.sci.$suggestSolution = "SCIB";
sci2.sci.$suggestSolution = "SCID";
sci3.sci.$suggestSolution = "SCIC";
